TALK_LETTERS = {
    'A': ['альфа'],
    'B': ['браво'],
    'C': ['чарли', 'шарли'],
    'D': ['дельта', 'дэльта', 'делта'],
    'E': ['эко', 'экоу', 'эхо'],
    'F': ['фокстрот'],
    'G': ['гольф'],
    'H': ['хотэл', 'хотел'],
    'I': ['индия', 'индиа'],
    'J': ['джульетт', 'джульетта',
          'джульет', 'джульета',
          'джульэтт', 'джульэтта',
          'джульэт', 'джульэта'],
    'K': ['кило'],
    'L': ['лима'],
    'M': ['майк'],
    'N': ['новембер', 'новэмбер',
          'новембе', 'новэмбе',
          'новэмбэ', 'новэмбэр'],
    'O': ['оскар'],
    'P': ['папа'],
    'Q': ['квебек', 'квэбек', 'квэбэк',
          'кебек', 'кэбек', 'кэбэк'],
    'R': ['роумио', 'ромео'],
    'S': ['сиерра', 'сьерра',
          'сиэра', 'сиэрра'],
    'T': ['танго'],
    'U': ['юниформ'],
    'V': ['виктор'],
    'W': ['виски', 'уиски'],
    'X': ['эксрей', 'эксрэй'],
    'Y': ['янки'],
    'Z': ['зулу'],
}

TALK_DIGITS_EN = {
    '0': ['зиро'],
    '1': ['уан'],
    '2': ['ту'],
    '3': ['три'],
    '4': ['фоуэр', 'фоуэ', 'фоэр'],
    '5': ['файф'],
    '6': ['сикс'],
    '7': ['севен'],
    '8': ['эйт'],
    '9': ['найнер'],
}

TALK_DIGITS_RU = {
    '0': ['ноль'],
    '1': ['единица'],
    '2': ['двойка'],
    '3': ['тройка'],
    '4': ['четвёрка', 'четверка'],
    '5': ['пятёрка', 'пятерка'],
    '6': ['шестёрка', 'шестерка'],
    '7': ['семёрка', 'семерка'],
    '8': ['восьмёрка', 'восьмерка'],
    '9': ['девятка'],
}

LISTEN_LETTERS = {}
for letter in TALK_LETTERS:
    codewords = TALK_LETTERS[letter]
    for codeword in codewords:
        LISTEN_LETTERS[codeword] = letter

LISTEN_DIGITS_EN = {}
for digit in TALK_DIGITS_EN:
    codewords = TALK_DIGITS_EN[digit]
    for codeword in codewords:
        LISTEN_DIGITS_EN[codeword] = digit

LISTEN_DIGITS_RU = {}
for digit in TALK_DIGITS_RU:
    codewords = TALK_DIGITS_RU[digit]
    for codeword in codewords:
        LISTEN_DIGITS_RU[codeword] = digit
